tap "cloudflare/cloudflare"
tap "dopplerhq/cli"
tap "homebrew/services"
tap "mongodb/brew"
tap "supabase/tap"
brew "ast-grep"
brew "awscli"
brew "cloudflared"
brew "cocoapods"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "imagemagick"
brew "jupyterlab"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "neovim"
brew "node@22"
brew "nvm"
brew "redis"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "tectonic"
brew "temporal"
brew "toilet"
brew "wget"
brew "zoxide"
brew "dopplerhq/cli/doppler"
brew "mongodb/brew/mongodb-community"
brew "supabase/tap/supabase"
cask "claude-code"
cask "font-symbols-only-nerd-font"
cask "ngrok"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
