tap "cloudflare/cloudflare"
tap "dopplerhq/cli"
tap "homebrew/services"
tap "mongodb/brew"
tap "supabase/tap"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "cloudflared"
brew "cocoapods"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "gum"
brew "imagemagick"
brew "jupyterlab"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "micro"
brew "neovim"
brew "node@22"
brew "nvm"
brew "redis"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tailscale"
brew "tectonic"
brew "temporal"
brew "toilet"
brew "tree"
brew "wget"
brew "zellij"
brew "zoxide"
brew "dopplerhq/cli/doppler"
brew "mongodb/brew/mongodb-community"
brew "supabase/tap/supabase"
cask "claude-code"
cask "codex"
cask "font-symbols-only-nerd-font"
cask "ngrok"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hermitter.oh-lucy-vscode"
vscode "ironm00n.magic-racket-student"
vscode "julialang.language-julia"
vscode "karyfoundation.racket"
vscode "leetcode.vscode-leetcode"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
npm "corepack"
